coocox/cox/Holtek/HT32F125x/cmsis_lib/lib/Src/ht32f125x_ckcu.c
  /* Get HCLK frequency                                                                                     */
  CKCU_Clk->HCLK_Freq = (CKCU_Clk->SYSCK_Freq) >> (CKCU->AHBCFGR);

  /* Get USART frequency                                                                                    */
  urpre = CKCU_BF_READ(CKCU->GCFGR, CKCU_MASK_URPRE, CKCU_POS_URPRE);
  CKCU_Clk->USART_Freq = (CKCU_Clk->HCLK_Freq) >> urpre;
  
  /* Get ADC frequency                                                                                      */
  div = CKCU_BF_READ(CKCU->APBCFGR, CKCU_MASK_ADCDIV, CKCU_POS_ADCDIV);
  if (div == 7)
  {
    CKCU_Clk->ADC_Freq = (CKCU_Clk->HCLK_Freq) / 6;
  }
  else
  {
    CKCU_Clk->ADC_Freq = (CKCU_Clk->HCLK_Freq) >> div;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the APB peripheral 0 clock.
 * @param CKCU_APBP: Specify the APB peripheral 0.
 *        This parameter can be:
 *        @arg CKCU_APBEN0_I2C , CKCU_APBEN0_SPI, CKCU_APBEN0_USART, CKCU_APBEN0_AFIO,
 *             CKCU_APBEN0_EXTI, CKCU_APBEN0_PA , CKCU_APBEN0_PB
 * @param Cmd: new status of the peripheral clock.
 *        This parameter can be:
 *        @arg ENABLE
 *        @arg DISABLE
 * @retval None
 ************************************************************************************************************/
void CKCU_APBPerip0ClockConfig(u32 CKCU_APBP, ControlStatus Cmd)
{
  /* Check the parameters */
  Assert_Param(IS_CKCU_APBEN0(CKCU_APBP));
  Assert_Param(IS_CONTROL_STATUS(Cmd));
  
  if (Cmd == ENABLE)
  {
    CKCU->APBCCR0 |= CKCU_APBP;
  }
  else
  {
    CKCU->APBCCR0 &= ~CKCU_APBP;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the APB peripheral 1 clock.
 * @param CKCU_APBP: Specify the APB peripheral 1.
 *        This parameter can be:
 *        @arg CKCU_APBEN1_WDT,  CKCU_APBEN1_RTC,  CKCU_APBEN1_GPTM0, CKCU_APBEN1_GPTM1,
 *             CKCU_APBEN1_OPA0, CKCU_APBEN1_OPA1, CKCU_APBEN1_ADC
 * @param Cmd: new status of the peripheral clock.
 *        This parameter can be:
 *        @arg ENABLE
 *        @arg DISABLE
 * @retval None
 ************************************************************************************************************/
void CKCU_APBPerip1ClockConfig(u32 CKCU_APBP, ControlStatus Cmd)
{
  /* Check the parameters */
  Assert_Param(IS_CKCU_APBEN1(CKCU_APBP));
  Assert_Param(IS_CONTROL_STATUS(Cmd));
  
  if (Cmd == ENABLE)
  {
    CKCU->APBCCR1 |= CKCU_APBP;
  }
  else
  {
    CKCU->APBCCR1 &= ~CKCU_APBP;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the HSE Clock Monitor function.
 * @param Cmd: new status of the Clock Monitor function.
 *        This parameter can be:
 *        @arg ENABLE
 *        @arg DISABLE
 * @retval None
 ************************************************************************************************************/
void CKCU_CKMCmd(ControlStatus Cmd)
{
  /* Check the parameters */
  Assert_Param(IS_CONTROL_STATUS(Cmd));
  
  CKCU_BB_CKMEN = Cmd;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the power saving wakeup RC clock.
 * @param Cmd: new status of the power saving wakeup RC clock.
 *        This parameter can be:
 *        @arg ENABLE
 *        @arg DISABLE
 * @retval None
 ************************************************************************************************************/
void CKCU_PSRCWKUPCmd(ControlStatus Cmd)
{
  /* Check the parameters */
  Assert_Param(IS_CONTROL_STATUS(Cmd));
  
  CKCU_BB_PSRCEN = Cmd;
}

/*********************************************************************************************************//**
 * @brief Select the output clock source through the CKOUT pin.
 * @param CKOUTInit: pointer to CKCU_CKOUTInitTypeDef structure that
 *                   contains the configuration information for the specific output clock source.
 * @retval None
 ************************************************************************************************************/
void CKCU_CKOUTConfig(CKCU_CKOUTInitTypeDef *CKOUTInit)
{
  CKCU_BF_WRITE(CKCU->GCFGR, CKCU_MASK_CKOUTSRC, CKCU_POS_CKOUTSRC, CKOUTInit->CKOUTSRC);
}

/*********************************************************************************************************//**
 * @brief Check if the specified CKCU interrupt has occurred.
 * @param CKCU_INT: Specify the CKCU interrupt source.
 *        This parameter can be:
 *        @arg CKCU_INT_CKS
 *        @arg CKCU_INT_PLLRDY
 *        @arg CKCU_INT_HSERDY
 *        @arg CKCU_INT_HSIRDY
 *        @arg CKCU_INT_LSERDY
 *        @arg CKCU_INT_LSIRDY
 * @retval The status of CKCU_INT, SET or RESET.
 ************************************************************************************************************/
FlagStatus CKCU_GetIntStatus(u8 CKCU_INT)
{
  FlagStatus RetValue;
  
  /* Check the parameters */
  Assert_Param(IS_CKCU_INT_FLAG(CKCU_INT));

  if ( (CKCU->GCIR & CKCU_INT) == RESET )
  {
    RetValue = RESET;
  }
  else
  {
    RetValue = SET;
  }

  return RetValue;
}

/*********************************************************************************************************//**
 * @brief Clear the CKCU interrupt flag.
 * @param CKCU_INT: Specify the CKCU interrupt flag to clear.
 *        This parameter can be:
 *        @arg CKCU_INT_CKS   : HSE clock failure interrupt (NMI) flag
 *        @arg CKCU_INT_PLLRDY: PLL ready interrupt flag
 *        @arg CKCU_INT_HSERDY: HSE ready interrupt flag
 *        @arg CKCU_INT_HSIRDY: HSI ready interrupt flag
 *        @arg CKCU_INT_LSERDY: LSE ready interrupt flag
 *        @arg CKCU_INT_LSIRDY: LSI ready interrupt flag
 * @retval None
 ************************************************************************************************************/
void CKCU_ClearIntFlag(u8 CKCU_INT)
{
  /* Check the parameters */
  Assert_Param(IS_CKCU_INT_FLAG(CKCU_INT));
   
  CKCU->GCIR |= CKCU_INT;
}

