coocox/cox/Holtek/HT32F125x/cmsis_lib/lib/Src/ht32f125x_ckcu.c
/*********************************************************************************************************//**
 * @brief Enable or Disable the specified CKCU interrupts.
 * @param CKCU_INT: Specify the CKCU interrupt source which is enabled or disabled.
 *        This parameter can be:
 *        @arg CKCU_INT_CKSIE    : HSE clock failure interrupt (NMI)
 *        @arg CKCU_INT_PLLRDYIE : PLL ready interrupt
 *        @arg CKCU_INT_HSERDYIE : HSE ready interrupt
 *        @arg CKCU_INT_HSIRDYIE : HSI ready interrupt
 *        @arg CKCU_INT_LSERDYIE : LSE ready interrupt
 *        @arg CKCU_INT_LSIRDYIE : LSI ready interrupt
 * @param Cmd: new status of the specific CKCU interrupts.
 *        This parameter can be:
 *        @arg ENABLE
 *        @arg DISABLE
 * @retval None
 ************************************************************************************************************/
void CKCU_IntConfig(u32 CKCU_INT, ControlStatus Cmd)
{
  u32 tmp1;
  
  /* Check the parameters */
  Assert_Param(IS_CKCU_INT(CKCU_INT));
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  tmp1 = CKCU->GCIR;
  if (Cmd != DISABLE)
  {
    tmp1 |= CKCU_INT;
  }
  else
  {
    tmp1 &= ~CKCU_INT;
  }

  /* Note: CKCU interrupt flags will be cleared by writing "1". */
  tmp1 &= ~0x0000007D;
  CKCU->GCIR = tmp1;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable SRAM/FMC clock during Sleep mode.
 * @param CKCU_CLK: Specify the clock which is enabled or disabled.
 *        This parameter can be:
 *        @arg CKCU_AHBEN_SLEEP_FMC, CKCU_AHBEN_SLEEP_SRAM
 * @param Cmd: new status of the specific clocks.
 *        This parameter can be:
 *        @arg ENABLE
 *        @arg DISABLE
 * @retval None
 ************************************************************************************************************/
void CKCU_SleepClockConfig(u32 CKCU_CLK, ControlStatus Cmd)
{
  /* Check the parameters */
  Assert_Param(IS_CKCU_SLEEP_AHB(CKCU_CLK));
  Assert_Param(IS_CONTROL_STATUS(Cmd));
  
  if (Cmd == ENABLE)
  {
    CKCU->AHBCCR |= CKCU_CLK;
  }
  else
  {
    CKCU->AHBCCR &= ~CKCU_CLK;
  }
}

/*********************************************************************************************************//**
 * @brief Check if PLL clock is being used by the specified target source.
 * @param Target: Specify the target clock.
 *        This parameter can be:
 *        @arg CKCU_PLLST_SYSCK : Is PLL used by system clock
 * @retval The status of target clock, TRUE or FALSE.
 ************************************************************************************************************/
bool CKCU_IS_PLL_USED(CKCU_PLLST_TypeDef Target)
{
  u32 temp;

  temp = (CKCU->CKST >> 8) & ((u32)Target);
  if (temp != FALSE)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/*********************************************************************************************************//**
 * @brief Check if HSI clock is being used by the specified target source.
 * @param Target: Specify the target clock.
 *        This parameter can be:
 *        @arg CKCU_HSIST_SYSCK: Is HSI used by system clock
 *        @arg CKCU_HSIST_PLL  : Is HSI used by PLL
 *        @arg CKCU_HSIST_CKM  : Is HSI used by clock monitor
 * @retval The status of target clock, TRUE or FALSE.
 ************************************************************************************************************/
bool CKCU_IS_HSI_USED(CKCU_HSIST_TypeDef Target)
{
  u32 temp;

  temp = (CKCU->CKST >> 24) & ((u32)Target);
  if (temp != FALSE)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/*********************************************************************************************************//**
 * @brief Check if HSE clock is being used by the specified target source.
 * @param Target: Specify the target clock.
 *        This parameter can be:
 *        @arg CKCU_HSEST_SYSCK : Is HSE used by system clock
 *        @arg CKCU_HSEST_PLL   : Is HSE used by PLL
 * @retval The status of target clock, TRUE or FALSE.
 ************************************************************************************************************/
bool CKCU_IS_HSE_USED(CKCU_HSEST_TypeDef Target)
{
  u32 temp;

  temp = (CKCU->CKST >> 16) & (u32)Target;
  if (temp != FALSE)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the specified debug function.
 * @param CKCU_DBGx: Specify the debug functions to be enabled or disabled.
 *        This parameter can be:
 *        @arg CKCU_DBG_SLEEP         , CKCU_DBG_DEEPSLEEP1
 *             CKCU_DBG_POWERDOWN     , CKCU_DBG_DEEPSLEEP2
 *             CKCU_DBG_WDT_HALT      , CKCU_DBG_GPTM0_HALT
 *             CKCU_DBG_GPTM1_HALT
 *             CKCU_DBG_USART_TIMEOUT , CKCU_DBG_SPI_TIMEOUT
 * @param Cmd: new status of the debug functions.
 *        This parameter can be:
 *        @arg ENABLE
 *        @arg DISABLE
 * @retval None
 ************************************************************************************************************/
void CKCU_MCUDBGConfig(u16 CKCU_DBGx, ControlStatus Cmd)
{
  /* Check the parameters */
  Assert_Param(IS_CKCU_DBG(CKCU_DBGx));
  Assert_Param(IS_CONTROL_STATUS(Cmd));
  
  if (Cmd != DISABLE)
  {
    CKCU->MCUDBGCR |= (u32)CKCU_DBGx;
  }
  else
  {
    CKCU->MCUDBGCR &= ~((u32)CKCU_DBGx);
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the Backup domain isolation control.
 * @param Cmd: new status of isolation control.
 *        This parameter can be:
 *        @arg ENABLE
 *        @arg DISABLE
 * @retval None
 ************************************************************************************************************/
void CKCU_BKISOCmd(EventStatus Cmd)
{
  /* Check the parameters */
  Assert_Param(IS_CONTROL_STATUS(Cmd));
  
  if (Cmd == DISABLE)
  {
    CKCU_BB_BKISO = 1;  /* Backup domain is accessible by other power domain */
  }
  else
  {
    CKCU_BB_BKISO = 0;  /* Backup domain is isolated from other power domain */
  }
}

/**
  * @}
  */  /* End of CKCU_Private_Function group */

/**
  * @}
  */  /* End of CKCU peripheral group */

/**
  * @}
  */  /* End of HT32F125x_Peripheral_Driver group */
